test-soap-request-v2.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ProvideQuotation xmlns="WS-IntegratedQuote">
      <userID>4072</userID>
      <userCode>111427</userCode>
      <quoteDetails>
        <ResidenceID>1</ResidenceID>
        <TypePolicyID>1</TypePolicyID>
        <TypePackageID>1</TypePackageID>
        <Destination>Europe</Destination>
        <StartDate>2025/09/28</StartDate>
        <EndDate>2025/09/30</EndDate>
        <Travellers>
          <TravellerNumber>1</TravellerNumber>
          <Title>Mr</Title>
          <FirstName>Nikos</FirstName>
          <LastName>Mexas</LastName>
          <DateOfBirth>1990/01/01</DateOfBirth>
          <Age>34</Age>
          <AgebandID>3</AgebandID>
          <TitleID>1</TitleID>
          <minAge>34</minAge>
          <maxAge>34</maxAge>
          <ScreeningInformation xsi:nil="true" />
        </Travellers>
        <ContactDetails>
          <Address>123 Main Street</Address>
          <Postcode>12345</Postcode>
          <Email>sara.mansola@gmail.com</Email>
          <Telephone>+496977772100</Telephone>
        </ContactDetails>
        <includeAnnualQuotes>0</includeAnnualQuotes>
        <includeUpsell>1</includeUpsell>
        <currencyID>1</currencyID>
        <groupPerProduct>false</groupPerProduct>
        <priceOrder>1</priceOrder>
        <useCoverLevelUpsell>true</useCoverLevelUpsell>
        <quoteVisitAuditID>1703123456789</quoteVisitAuditID>
      </quoteDetails>
    </ProvideQuotation>
  </soap:Body>
</soap:Envelope>



